---
kind: method
id: M:Autodesk.Revit.DB.TriOrQuadFacet.Dispose
source: html/97fa5907-9dfd-98c8-8d04-debbb2a5d1e8.htm
---
# Autodesk.Revit.DB.TriOrQuadFacet.Dispose Method

Releases all resources used by the TriOrQuadFacet

## Syntax (C#)
```csharp
public void Dispose()
```